import Base from './Base';
import CoordConvertFactory from '../CoordConvertFactory';
import CoordConvertType from '../CoordConvertType';
import GD from './GD';

class BD extends Base{
    constructor(params){
        super(params);
        this.MC2LL=[
            [1.410526172116255e-8, 898305509648872e-20, -1.9939833816331, 200.9824383106796, -187.2403703815547, 91.6087516669843, -23.38765649603339, 2.57121317296198, -.03801003308653, 17337981.2],
            [-7.435856389565537e-9, 8983055097726239e-21, -.78625201886289, 96.32687599759846, -1.85204757529826, -59.36935905485877, 47.40033549296737, -16.50741931063887, 2.28786674699375, 10260144.86],
            [-3.030883460898826e-8, 898305509983578e-20, .30071316287616, 59.74293618442277, 7.357984074871, -25.38371002664745, 13.45380521110908, -3.29883767235584, .32710905363475, 6856817.37],
            [-1.981981304930552e-8, 8983055099779535e-21, .03278182852591, 40.31678527705744, .65659298677277, -4.44255534477492, .85341911805263, .12923347998204, -.04625736007561, 4482777.06],
            [3.09191371068437e-9, 8983055096812155e-21, 6995724062e-14, 23.10934304144901, -.00023663490511, -.6321817810242, -.00663494467273, .03430082397953, -.00466043876332, 2555164.4],
            [2.890871144776878e-9, 8983055095805407e-21, -3.068298e-8, 7.47137025468032, -353937994e-14, -.02145144861037, -1234426596e-14, .00010322952773, -323890364e-14, 826088.5]
        ];
        this.LL2MC=[
            [-.0015702102444, 111320.7020616939, 1704480524535203.0, -10338987376042340.0, 26112667856603880.0, -35149669176653700.0, 26595700718403920.0, -10725012454188240.0, 1800819912950474.0, 82.5],
            [.0008277824516172526, 111320.7020463578, 647795574.6671607, -4082003173.641316, 10774905663.51142, -15171875531.51559, 12053065338.62167, -5124939663.577472, 913311935.9512032, 67.5],
            [.00337398766765, 111320.7020202162, 4481351.045890365, -23393751.19931662, 79682215.47186455, -115964993.2797253, 97236711.15602145, -43661946.33752821, 8477230.501135234, 52.5],
            [.00220636496208, 111320.7020209128, 51751.86112841131, 3796837.749470245, 992013.7397791013, -1221952.21711287, 1340652.697009075, -620943.6990984312, 144416.9293806241, 37.5],
            [-.0003441963504368392, 111320.7020576856, 278.2353980772752, 2485758.690035394, 6070.750963243378, 54821.18345352118, 9540.606633304236, -2710.55326746645, 1405.483844121726, 22.5],
            [-.0003218135878613132, 111320.7020701615, .00369383431289, 823725.6402795718, .46104986909093, 2351.343141331292, 1.58060784298199, 8.77738589078284, .37238884252424, 7.45]
        ];
        this.MCBAND=[12890594.86, 8362377.87, 5591021, 3481989.83, 1678043.12, 0];
        this.LLBAND=[75, 60, 45, 30, 15, 0];
        this.type=1;//1百度米制坐标，2百度经纬度坐标 默认为1
        this.gdObj=new GD("");
        if (this.params) {
            if(this.params=="2"){
                this.type=2;
            }else{
                this.type=1;
            }
        }
    }

    /**
     * 将WGS84经纬度坐标转换为百度经纬度或百度平面
     * @param lon 将WGS84经度
     * @param lat 将WGS84纬度
     * @returns {*[]}
     */
    convert(lon, lat){
        var bdll = this.gdObj.wgs84ll2bdll(lon, lat);

        if(this.type==2){
            console.info("百度经纬度："+lon+","+lat+","+bdll[0]+","+bdll[1]);
            return bdll;
        }else{
            var bdmc = this.bdll2bdmc(bdll[0],bdll[1]);
            console.info("百度米："+lon+","+lat+","+bdmc[0]+","+bdmc[1]);
            return bdmc;
        }
    }


    /**
     * 百度经纬度转百度平面(米制坐标)
     * @param bd_lon 百度经度
     * @param bd_lat 百度纬度
     * @returns {*}
     */
    bdmc2bdll(x,y){
        var e = [Math.abs(x),Math.abs(y)];
        var i=null;
        for (var n=0;n<this.MCBAND.length;n++) if(e[1]>=this.MCBAND[n]){
            i=this.MC2LL[n];
            break;
        }
        return this.convertor(e,i);
    }
    /**
     * 百度经纬度转百度平面(米制坐标)
     * @param bd_lon 百度经度
     * @param bd_lat 百度纬度
     * @returns {*}
     */
    bdll2bdmc(bd_lon,bd_lat) {
        var e;
        var i = null;
        var x = this.getLoop(bd_lon, -180, 180);
        var y = this.getRange(bd_lat, -74, 74);
        e = [x,y];
        for (var n = 0; n < this.LLBAND.length; n++) {
            if (e[1] >= this.LLBAND[n]) {
                i = this.LL2MC[n];
                break;
            }
        }
        if (i == null) {
            for (var n = this.LLBAND.length - 1; n >= 0; n--) {
                if (e[1] <= -this.LLBAND[n]) {
                    i = this.LL2MC[n];
                    break;
                }
            }
        }
        return this.convertor([x,y], i);
    }

    convertor(t, e) {
        if (t != null && e != null) {
            var i = e[0] + e[1] * Math.abs(t[0]),
                n = Math.abs(t[1]) / e[9],
                a = e[2] + e[3] * n + e[4] * n * n + e[5] * n * n * n + e[6] * n * n * n * n + e[7] * n * n * n * n * n + e[8] * n * n * n * n * n * n;
            i *= t[0] < 0 ? -1 : 1;
            a *= t[1] < 0 ? -1 : 1;
            //保留小数点后6位
            i = parseFloat(i.toFixed(6));
            a = parseFloat(a.toFixed(6));
            return [i, a];
        }
        return null;
    }

    getLoop(t, e, i) {
        for(; t > i;) {
            t -= i - e;
        }
        for (; e > t;) {
            t += i - e;
        }
        return t;
    }

    getRange(t, e, i) {
        t = Math.max(t, e);
        t = Math.min(t, i);
        return t;
    }
}
if(!CoordConvertFactory[CoordConvertType.BD]){
    CoordConvertFactory[CoordConvertType.BD] = BD;
}
export default BD;